# Вывод символов по диагоналям
# Даны сторона квадрата. Вывести его диагонали символами #.
# Формат входных данных: На вход программе одно целое число a (2<a≤30) - сторона квадрата.
# Формат выходных данных: Требуется вывести диагонали символами # (см. примеры)
# Примеры:
# a = 6
#    #
 #  #
  ##
  ##
 #  #
#    #

# a = 3
# #
 #
# #


# TODO: your code here

side = int(input("Сторона квадрата: "))

last = side
first = 1
j = 1

while j <= side:
    string = ""
    i = 1
    while i <= side:
        if i == first or i == last:
            string += "#"
        else:
            string += " "
        i += 1
    print(string)
    first += 1
    last -= 1
    j += 1
